{ 
    "releases": [{
            "version": "1.3.0",
            "date": "June 3rd, 2025",
            "changes": [
                "Added an option to continue playing with the selected restart settings, highscores are disabled with it. Also added a setting to enable it by default.",
                "Automap now automatically adds parts without lyrics if you don't specify any and use a file which has lyricless parts that are at least 8 seconds long.",
                "Now when you export/download a map that uses the default background image, the background image data will not be saved in the file.",
                "If a lyricless part which is added to automap in text mode starts at 0:00, it no longer is shortened by 1 second at the start.",
                "Updated the automap section of the about page to mention the new automap parts without lyrics from file being 2 seconds shorter too.",
                "Fixed the information on the song list page always being moved up like if the fullscreen button was there in the version on my website."
            ]
        },
        {
            "version": "1.2.2",
            "date": "June 1st, 2025",
            "changes": [
                "Fixed a typo in the first word of the about page. Lyrythmics -> Lyrhythmics"
            ]
        },
        {
            "version": "1.2.1",
            "date": "June 1st, 2025",
            "changes": [
                "Changed the code a bit to make dynamic map loading work on Newgrounds and itch.io, decreasing initial loading time by a lot.",
                "The darkening and blur effect behind menus now has a higher opacity to make it easier to read the text in the menu.",
                "Now when a .lrc file provides the information on who made the file, automap sets the map author to \"Automap (.lrc by author)\".",
                "Automap now sets the song name to just the provided title if there's no information on who made it or if the provided title contains \" - \", which means that it most likely already contains the creator.",
                "The itch.io version now uses the in-game fullscreen button instead of itch.io's built-in one.",
                "The fullscreen button that's on Newgrounds and now itch.io is no longer on top of the text in the song list.",
                "The hover title of the fullscreen button now has a full stop at the end of it."
            ]
        },
        {
        "version": "1.2.0",
        "date": "May 31st, 2025",
        "changes": [
            "Added autospace, a setting which automatically moves you to the next word when you type a word correctly or the current word passes.",
            "Added a setting that makes the pitch in songs change along with the speed.",
            "The map customization and end screens now have a download map button if the map was generated by automap.",
            "Now when a .lrc file provides the title and information on who made the song, automap sets the song name to that instead of the audio file name.",
            "Ł and Ø are now properly replaced when accent letters are disabled.",
            "When you use the arrows to change the number in the custom speed input, it now gets changed by 0.125 instead of 1.",
            "Removed 2 and 0.375 from the list of suggested speeds, added 1.375 and 0.625 instead.",
            "Grouped the main settings into two categories, general and default map customization.",
            "Renamed Editor settings to Editor/playtesting settings.",
            "Changed the order of some settings.",
            "Added horizontal lines to the left and right sides of setting categories and removed the colon.",
            "Song samples in the main menu are now played at the speed configured in the default speed setting.",
            "Changed the look of the optional fullscreen button that's on Newgrounds and made it so it's always there instead of just in the main menu.",
            "Added a setting to hide the fullscreen button, it's only there if the variant of the game has the fullscreen button enabled.",
            "Updated the press any key to start message which appears when you start in a lyricless part. The \"a\" before a number is now replaced with \"an\" when necessary, when the part isn't added to the lyricless parts list it now says it's unmarked instead of short, the text for it not being skipped is new and the time until the end of the unmarked lyricless part or its length is now displayed.",
            "Added information on how to see the changelog to the about page.",
            "The information on the about page regarding pressing escape making you leave fullscreen is now there in the itch.io version as well.",
            "Fixed the playtest button disable happening also in the settings menu.",
            "Text in the changelog now has a maximum width, it's the same as on the about page.",
            "All alternative texts for images now start with a uppercase letter, also fixed one occurance of \"Background image\" instead of \"Background\"."
        ]
    },
    {
        "version": "1.1.0",
        "date": "May 27th, 2025",
        "changes": [
            "Added .srt, .vtt and .lrc file support. They can be uploaded in automap and in the map editor.",
            "Added the word length limit setting. It allows you to limit the amount of letters in each word.",
            "The main menu background lyrics are now only visible if no menu is open.",
            "Updated the text on the automap page, in the automap and editor sections of the about page, as well as in the corner of the song list.",
            "Changed the error message for trying to upload a non-JSON file to load map.",
            "Replaced the text that says \"Ok\" on a button in the add lyrics menu in the editor with \"Add\".",
            "Added an optional fullscreen button to the main menu, it's enabled in the Newgrounds version.",
            "Made it so the playtest button is disabled if your scroll position is after the end of the lyrics.",
            "When opening the map editor by creating a new map, the speed is now set to the value of the default speed setting instead of 1.",
            "Fixed the hover title on the add lyrics button that says \"Input the lyrics first.\" not being there if you input just spaces or enters.",
            "Fixed negative start time upper limit when the map is shorter than 0.1 seconds and length not being displayed if the map is 0 seconds long.",
            "Improved the code a bit, most notably replaced sections with divs."
        ]
    },
    {
        "version": "1.0.1",
        "date": "May 23rd, 2025",
        "changes": [
            "Fixed a typo on the about page. Hovewer -> However",
            "Fixed text not being centered in the changelog if there's more than one version.",
            "The version in the corner of the main menu is now loaded from the changelog.json file."
        ]
    },
    {
        "version": "1.0.0",
        "date": "May 23rd, 2025",
        "changes": [
            "Initial release."
        ]
    }]
}